task.ipynb

{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e6abb8bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HTTP error: 500\n",
      "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><soap:Fault><faultcode>soap:Client</faultcode><faultstring>Server was unable to read request. ---&gt; There is an error in XML document (7, 40). ---&gt; The string '.!entryT00:00:00' is not a valid AllXsd value.</faultstring><detail /></soap:Fault></soap:Body></soap:Envelope>\n",
      "HTTP error: 500\n",
      "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><soap:Fault><faultcode>soap:Client</faultcode><faultstring>Server was unable to read request. ---&gt; There is an error in XML document (7, 40). ---&gt; The string '.!entryT00:00:00' is not a valid AllXsd value.</faultstring><detail /></soap:Fault></soap:Body></soap:Envelope>\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "import xml.etree.ElementTree as ET\n",
    "from tkinter import *\n",
    "from tkinter import ttk\n",
    "\n",
    "def get_usd_rate_by_date(date_str):\n",
    "    url = \"https://api.cba.am/exchangerates.asmx\"\n",
    "    headers = {\n",
    "        \"Content-Type\": \"text/xml; charset=utf-8\",\n",
    "        \"SOAPAction\": \"http://www.cba.am/ExchangeRatesByDateByISO\"\n",
    "    }\n",
    "\n",
    "    # Construct the SOAP XML body\n",
    "    body = f\"\"\"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n",
    "    <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n",
    "                   xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n",
    "                   xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n",
    "      <soap:Body>\n",
    "        <ExchangeRatesByDateByISO xmlns=\"http://www.cba.am/\">\n",
    "          <date>{date_str}T00:00:00</date>\n",
    "          <ISO>USD</ISO>\n",
    "        </ExchangeRatesByDateByISO>\n",
    "      </soap:Body>\n",
    "    </soap:Envelope>\"\"\"\n",
    "\n",
    "    # Send the SOAP request\n",
    "    response = requests.post(url, headers=headers, data=body)\n",
    "\n",
    "    if response.status_code != 200:\n",
    "        print(f\"HTTP error: {response.status_code}\")\n",
    "        print(response.text)\n",
    "        return\n",
    "\n",
    "    # Parse the XML response\n",
    "    namespaces = {\n",
    "        'soap': 'http://schemas.xmlsoap.org/soap/envelope/',\n",
    "        'cba': 'http://www.cba.am/'\n",
    "    }\n",
    "\n",
    "    #print(namespaces)\n",
    "\n",
    "    root = ET.fromstring(response.content)\n",
    "\n",
    "    print(response.content)\n",
    "\n",
    "    # Find the exchange rate info\n",
    "    rate_elem = root.find('.//cba:ExchangeRate', namespaces)\n",
    "    if rate_elem is None:\n",
    "        print(\"USD exchange rate not found.\")\n",
    "        return\n",
    "    \n",
    "    #print(root)\n",
    "\n",
    "    iso = rate_elem.find('cba:ISO', namespaces).text\n",
    "    amount = rate_elem.find('cba:Amount', namespaces).text\n",
    "    rate = rate_elem.find('cba:Rate', namespaces).text\n",
    "\n",
    "    print(f\"USD Exchange Rate on {date_str}:\")\n",
    "    print(f\"  Rate    : {rate}\")\n",
    "    print(f\"  Amount  : {amount}\")\n",
    "\n",
    "def input_text():\n",
    "   global date_str\n",
    "   string= date_str.get()\n",
    "   myLebel.configure(text=string)\n",
    "\n",
    "\n",
    "def button_clicked():\n",
    "    #ttk.Button(root, text=\"GET\", command= input_text).pack()\n",
    "    get_usd_rate_by_date(date_str)\n",
    "\n",
    "root = Tk()\n",
    "\n",
    "root.geometry(\"750x250\")\n",
    "\n",
    "myLebel = Label(root, text = \"Exchange Currency\")\n",
    "\n",
    "myLebel.pack()\n",
    "\n",
    "\n",
    "date_str = Entry(root, width = 40)\n",
    "date_str.focus_set()\n",
    "date_str.pack()\n",
    "\n",
    "    \n",
    "\n",
    "\n",
    "ttk.Button(root, text = \"Input currency\", width= 20, command= input_text)\n",
    "\n",
    "\n",
    "get_button = Button(root, \n",
    "                   text=\"Get USD Rate\", \n",
    "                   command=button_clicked,\n",
    "                   activebackground=\"blue\", \n",
    "                   activeforeground=\"white\",\n",
    "                   anchor=\"center\",\n",
    "                   bd=3,\n",
    "                   bg=\"lightgray\",\n",
    "                   cursor=\"hand2\",\n",
    "                   disabledforeground=\"gray\",\n",
    "                   fg=\"black\",\n",
    "                   font=(\"Arial\", 12),\n",
    "                   height=2,\n",
    "                   highlightbackground=\"black\",\n",
    "                   highlightcolor=\"green\",\n",
    "                   highlightthickness=2,\n",
    "                   justify=\"center\",\n",
    "                   overrelief=\"raised\",\n",
    "                   padx=10,\n",
    "                   pady=5,\n",
    "                   width=15,\n",
    "                   wraplength=100)\n",
    "\n",
    "get_button.pack(padx=20, pady=20)\n",
    "\n",
    "root.mainloop()\n",
    "\n",
    "\n",
    "#date_str = input(\"YYYY-MM-DD\")\n",
    "\n",
    "get_usd_rate_by_date(date_str)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
